Tekla.Structures.Model.BoltXYList
The BoltXYList class defines a bolt group with an XY list shape. The bolt group is the most generic one
of the bolt groups.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using System;
public class Example
{
public void Example1()
{
ContourPlate cp = new ContourPlate();
cp.Profile.ProfileString = "PL20";
cp.AddContourPoint(new ContourPoint(new Point( 6000,  6000, 0),null));
cp.AddContourPoint(new ContourPoint(new Point( 9000,  6000, 0),null));
cp.AddContourPoint(new ContourPoint(new Point( 9000, 12000, 0),null));
cp.AddContourPoint(new ContourPoint(new Point( 6000, 12000, 0),null));
if (!cp.Insert())
Console.WriteLine("ContourPlate Insert failed!");
BoltXYList B = new BoltXYList();
B.PartToBeBolted = cp;
B.PartToBoltTo   = cp;
B.FirstPosition =  new Point(6200,  6200, 0);
B.SecondPosition = new Point(9000, 12000, 0);
B.BoltSize     = 16;
B.Tolerance    = 3.00;
B.BoltStandard = "7968";
B.BoltType     = BoltGroup.BoltTypeEnum.BOLT_TYPE_WORKSHOP;
B.CutLength    = 105;
B.Length       = 50;
B.ExtraLength  = 15;
B.ThreadInMaterial = BoltGroup.BoltThreadInMaterialEnum.THREAD_IN_MATERIAL_NO;
B.Position.Depth          = Position.DepthEnum.MIDDLE;
B.Position.Plane          = Position.PlaneEnum.MIDDLE;
B.Position.Rotation       = Position.RotationEnum.FRONT;
B.Bolt    = true;
B.Washer1 = true;
B.Washer2 = true;
B.Washer3 = true;
B.Nut1    = true;
B.Nut2    = true;
B.Hole1   = true;
B.Hole2   = true;
B.Hole3   = true;
B.Hole4   = true;
B.Hole5   = true;
B.AddBoltDistX(100);
B.AddBoltDistX(200);
B.AddBoltDistX(300);
B.AddBoltDistY(100);
B.AddBoltDistY(200);
B.AddBoltDistY(300);
if (!B.Insert())
Console.WriteLine("BoltXYList Insert failed!");
}
}

Tekla.Structures.Model.BoltXYList._BoltDistX
Bolt Dist X

Tekla.Structures.Model.BoltXYList._BoltDistY
Bolt Dist Y

Tekla.Structures.Model.BoltXYList.#ctor
Creates a new bolt XY list instance.

Tekla.Structures.Model.BoltXYList.AddBoltDistX(System.Double)
Adds an X distance to the bolt XY list.
DistX: The X distance to be added.
Returns: True if the distance was added. Throws an OverflowException if there was no more space for the distance.

Tekla.Structures.Model.BoltXYList.AddBoltDistY(System.Double)
Adds a Y distance to the bolt XY list.
DistY: The Y distance to be added.
Returns: True if the distance was added. Throws an OverflowException if there was no more space for the distance.

Tekla.Structures.Model.BoltXYList.GetBoltDistXCount
Returns the amount of X distances in the bolt XY list.
Returns: The amount of X distances.

Tekla.Structures.Model.BoltXYList.GetBoltDistYCount
Returns the amount of Y distances in the bolt XY list.
Returns: The amount of Y distances.

Tekla.Structures.Model.BoltXYList.GetBoltDistX(System.Int32)
Returns the X distance defined by the argument.
Index: The index to the distance list.
Returns: The distance defined by the argument.

Tekla.Structures.Model.BoltXYList.GetBoltDistY(System.Int32)
Returns the Y distance defined by the argument.
Index: The index to the distance list.
Returns: The distance defined by the argument.

Tekla.Structures.Model.BoltXYList.Insert
Inserts the bolt XY list into the model database. All the attributes must be set.
Returns: True on success.

Tekla.Structures.Model.BoltXYList.Select
Selects a bolt XY list from the model database. The ID must be set.
Returns: True on success.

Tekla.Structures.Model.BoltXYList.Modify
Modifies the existing bolt XY list in the model database to match the current one.
Note, the IDs of Part To Bolt To, Part To Be Bolted and OtherParts cannot be modified.
Returns: True on success.

Tekla.Structures.Model.BoltXYList.Delete
Deletes the bolt XY list instance with the given ID from the model database.
Returns: True on success.

Tekla.Structures.Model.BoltXYList.FlipBoltDistanceInY
Flips bolt distance in Y.

Tekla.Structures.Model.BoltXYList.InsertSplitBolt
Inserts the bolt XY list into the model database. All the attributes must be set.
Returns: True on success.

Tekla.Structures.Model.BoltXYList.CreateSplitBoltInstance
Creates the split bolt instance.
Returns: True on succes, false otherwise.